2017/04/14

web24


写简历
    技能
    项目
    教育经历
    工作经验


投简历
    拉勾(假公司比较多, 100 中 5 差不多)
    boss 直聘, 野鸡比较多(100 中 5)
    智联/51job(小城市)
    原则是海投海面 不要有感情
    注意不要被培训公司诈骗


特殊情况, 来找我私聊



找工作
    海投，300起，智联 51 拉钩 boss
    简历要给我过目，按照模板写
    重复投简历，一圈圈投
    两本 SQL必知必会 要看
    Python面试大全 要搞懂



职业发展
    个人能力
        1，不能闭门造车
        2，要按照计划学习
        3，以工作和web开发为主要方向
        4，多搜索，多了解
        5，积极主动
    行业方向
        行业发展和市场有关，和技术无关
        对个人来说，要选择前景广阔的行业（web前后端）
        一定要选通用的技术和行业方向

个人发展
    1，不要对公司有感情，一切以自己为重
    2，除了编程，还有很多其他重要的事情
    3，总结出自己进步的方法
    4，做计划的正确方式
    5，提问表格




工作
1, 工作之后的规划
    1) 规划跳槽, 从第一天起
        规划好自己半年/一年后的状态
        规划好达到那个状态需要做的计划
        不要对公司/老板有盲目的感恩之心，互利双赢才能长久
        要以自己的规划为主
    2) 要设定职业规划, 探索职业方向
        要照顾到自己的喜好, 做喜欢的事情
        要保护好自己的热情(做喜欢的事情, 尽量避免被公司业务污染)
            要符合自己的意义
            公务员的工作有意义，但是你不认同也会做着痛苦
    3) 认清自己的地位
        你做了自己的选择，并不只是运气好
        你只是一个流水线工人
        一个公司相当于一个作坊, 由 前端/后端/设计/产品/测试 合作完成一个东西
            资深工人
            多工种工人
    4) 个人增值的方式
        把某个技术做精, 变成专家级流水工
            坏处就是万一被淘汰就跪了
            还有就是鸡蛋放到一个篮子里面了
            选择的空间也少, 比如 nokia 和 moto 被裁员的员工
            为了避免这个窘况, 大家要做流行性高/通用性强的方向
                ios 安卓 就不行
                web 更长青
                编程能力是最重要的，切换语言很简单
                市场如果有需求，一夜之间千万 xx 语言码农就出来了
        横跨多个领域, 做复合型掏粪工
            比如全栈, 就是典型的复合型掏粪工
                掏得越多越好 越快越好
            比如技术和其他领域的结合
                软件 + 医疗
                互联网 +


2, 学习的计划
    合理正确的规划方式
        时间不要贪多, 以自己能接受为前提, 从小到大慢慢提高
            计划太多学不完
            学不完有负罪感
            然后就炸了
            所以要慢慢来，遵循客观规律
            不要妄自菲薄（我自控力差，我做不好事）
        目标要细化, 最好是把事情分解为 20 分钟甚至 10 分钟能解决的程度
            目标大了就会拖，拖了就做不完
            把目标写下来
            一条条做
        要合理看待不能完成的任务, 要有标准化的预案
            比如超过设定的极限时间不能解决就提问
    避免买包出斧心理
        买包就是试图付出 xx 资源来得到 yy 好处（无视客观规律）
        出斧就是情绪驱动，不按照客观规律做事
        不要试图通过去学一些奇怪的东西来提高能力
            我要看原版书，我看原版书，得到原汁原味的知识
                有些东西英语就是英语，用中文是无法表达的
            我要学 java
            我要学人工智能
            我要学底层（什么是底层？）
        不要被情绪驱动, 要按照计划来做事/学习
            不能说今晚做不出就不睡
            不能说我一定要自己想出来才是我的，该问就问


3, 知识点的聚合


4, 其他
    倍速视频
        节约时间
        集中精力
    论坛提问的表格具有很高的价值, 要善加利用
        比提问的智慧简单很多
        是长期实践中归纳总结出来的方法
    怎样选择要读的书(不限于技术书)
        绝大部分书都是垃圾
        即便是好书, 大部分内容很可能也没什么用
        粗读, 不要精读
        绝不要去读原版
        这些是我长期实践的总结，仅供参考
    更多的训练项目
    HTTP 协议(主要用在 AJAX 上)
        用到再学
    改键位和快捷键
        https://zhuanlan.zhihu.com/p/24020977
*/
